Revit 2026 API

# DividedPathFixedNumberOfPoints Property

---

The number of points used when the layout is set to 'FixedNumber'.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int FixedNumberOfPoints { get; set; }
```
```vb
Public Property FixedNumberOfPoints As Integer
	Get
	Set
```
```cpp
public:
property int FixedNumberOfPoints {
	int get ();
	void set (int value);
}
```
```fsharp
member FixedNumberOfPoints : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: fixedNumberOfPoints must be at least 2 and at most 200. |

To get the actual number of point use GetNumberOfPoints().

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace